Repository: NevronOffice/localization-support
Catalog: Localization/NovDictionary_de-DE.tmx
Source language: en_us
Languages: de_de

source: Insurance Claim Flowchart
de_de: Versicherungsfall Flussdiagramm

source: Late Payments Process Flowchart
de_de: Verspätete Zahlungen Prozess Flussdiagramm

source: Medical Care Process Flowchart
de_de: Medizinische Versorgung Prozess Flussdiagramm

source: Nomination and Confirmation Process
de_de: Nominierung und Bestätigung zu

source: Ordering Services Process Flowchart
de_de: Bestellung von Dienstleistungen Prozess Flussdiagramm

source: Order Management Flowchart
de_de: Order Management Flussdiagramm

source: Order Processing Flowchart
de_de: Bestellung Verarbeitung Flussdiagramm

source: Partner Payment Processing Flowchart
de_de: Partner Zahlung Verarbeitung Flussdiagramm

source: Purchasing and Procurement Process Flowchart
de_de: Einkauf und Beschaffung Prozess Flussdiagramm

source: Recruiting Process Flowchart
de_de: Recruiting-Prozess Flussdiagramm

source: Shipping Process Flowchart
de_de: Versand-Prozess Flussdiagramm

source: Simple Flowchart
de_de: Einfaches Flussdiagramm

source: Supply Ordering Process Flowchart
de_de: Lieferung Bestellung Prozess Flussdiagramm

source: Supply Procurement Flowchart
de_de: Beschaffung-Flussdiagramm zu liefern

source: Termination Process Flowchart
de_de: Kündigung-Prozess Flussdiagramm

source: Transaction Flow Diagram
de_de: Transaktion Flussdiagramm

source: Vendor Payment Process Flowchart
de_de: Kreditor Zahlung Prozess Flussdiagramm

source: British Royal Family Tree
de_de: Britische königliche Familie Baum

source: Kennedy Family Tree
de_de: Kennedy Stammbaum

source: Lincoln Family Tree
de_de: Lincoln-Stammbaum

source: The Simpsons Family Tree
de_de: Die Simpsons-Stammbaum

source: City Administration Organizational Chart
de_de: Organigramm der Stadt-Verwaltung

source: City of Glenn Heights Organizational Chart
de_de: Organigramm der Stadt von Glenn Höhen

source: City Org Chart
de_de: Organigramm der Stadt

source: Colorado Bureau of Investigation Organizational Chart
de_de: Colorado-Büro der Untersuchung Organigramm

source: Company Organizational Chart
de_de: Unternehmen-Organigramm

source: Corporate Organizational Chart
de_de: Corporate Organigramm

source: Corporate Structure Organizational Chart
de_de: Organigramm der Unternehmensstruktur

source: Department Structure Organizational Chart
de_de: Organigramm der Abteilung Struktur

source: Design Team Organizational Chart
de_de: Design Team Organigramm

source: Environmental Agency Organizational Chart
de_de: Organigramm der Umweltbehörde

source: Finance Division Organizational Chart
de_de: Finance Division Organigramm

source: Gaming Company Organizational Chart
de_de: Gaming-Unternehmen-Organigramm

source: Magazine Organizational Chart
de_de: Magazin-Organigramm

source: Marketing Department Org Chart
de_de: Organigramm der Abteilung Marketing

source: Modern Organizational Chart
de_de: Modernen Organigramm

source: Olympic Games Org Chart
de_de: Olympische Spiele-Organigramm

source: Photo Org Chart
de_de: Foto-Organigramm

source: Project Team Organizational Chart
de_de: Projekt Team Organigramm

source: Research Division Organizational Chart
de_de: Organigramm der Research Division

source: Retail Startup Organizational Chart
de_de: Einzelhandel-Startup-Organigramm

source: School District Organization Chart
de_de: Schulbezirk-Organigramm

source: Share Point Organizational Chart
de_de: Share-Point Organigramm

source: Small Company Organizational Chart
de_de: Kleines Unternehmen-Organigramm

source: Software Company Organizational Chart
de_de: Organigramm Software-Firma

source: Travel Agency Organizational Chart
de_de: Reisebüro-Organigramm

source: US Government Org Chart
de_de: Organigramm der US-Regierung
